---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.GetEnumerator
source: html/dfd66e39-5804-b175-e037-9d7935784bf3.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.